Revit 2027 API
FamilySymbolFilter Constructor
 Constructs a new instance of a filter to find all family symbols of the given family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilySymbolFilter(
	ElementId familyId
)
Public Sub New (
	familyId As ElementId
)
public:
FamilySymbolFilter(
	ElementId^ familyId
)
new :
        familyId : ElementId -> FamilySymbolFilter
Parameters
familyId ElementId
 The family id.
Exceptions
Exception | Condition
ArgumentException |  The familyId is invalid.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FamilySymbolFilter Class
Autodesk.Revit.DB Namespace